# -*- coding:utf-8 -*-

from toolsForExcel import *
import requests
import json
import time

headers = {
    "Accept-Language": "zh-CN,zh;q=0.8",
    "User-Agent": "Mozilla/5.0 (Linux; U; Android 8.0.0; zh-cn; PRA-AL00 Build/HONORPRA-AL00) AppleWebKit/534.30 (KHTML, like Gecko) Version/4.0 Mobile Safari/534.30",
    "Host": "www.edu-edu.com",
    "Accept-Encoding": "gzip",
    "Cookie": "JSESSIONID=2202C4ADBF8BE7CF28B67382ED0BB425; JSESSIONID=1617217F21158A865666E637D60D8EB7; service='http://www.edu-edu.com/sale/cas_security_check'; org.springframework.mobile.device.site.CookieSitePreferenceRepository.SITE_PREFERENCE=MOBILE; _tenant=default; JSESSIONID=8469ABC29C89EFE81BA27FFE19122CD0; JSESSIONID=118579BCB2CC902808C2EA63B48224CE",
    "Connection": "keep-alive"
}

headers1 = {"User-Agent": "Mozilla/5.0 (Linux; U; Android 7.0; zh-cn; Redmi Note 4X Build/NRD90M) AppleWebKit/534.30 (KHTML, like Gecko) Version/4.0 Mobile Safari/534.30",
            "Connection": "keep-alive",
            "Accept-Encoding": "gzip",}

def get_subjectId():
    subjectId=[[1,'00009政治经济学（财经类）'], [4, '00020高等数学（一）'], [5, '00022高等数学（工专）'], [6, '00023高等数学（工本）'], [24, '12656毛泽东思想和中国特色社会主义理论体系概论'], [25, '03706思想道德修养与法律基础'], [26, '00012英语（一）'], [27, '00015英语（二）'], [32, '00595英语阅读（一）'], [35, '03709马克思主义基本原理概论'], [36, '03708中国近现代史纲要'], [37, '04729大学语文'], [38, '00024普通逻辑'], [39, '00051管理系统中计算机应用'], [41, '00054管理学原理'], [42, '04183概率论与数理统计（经管类）'], [43, '00420物理（工）'], [44, '00429教育学（一）'], [45, '00034社会学概论'], [46, '00037美学'], [47, '00040法学概论'], [48, '00041基础会计学'], [49, '00053对外经济管理概论'], [50, '00055企业会计学'], [67, '00244经济法概论'], [71, '04184线性代数（经管类）'], [91, '02197概率论与数理统计（二）'], [93, '02324离散数学'], [195, '00018计算机应用基础'], [230, '02198线性代数'], [7, '00043经济法概论（财经类）'], [8, '00058市场营销学'], [9, '00067财务管理学'], [10, '00070政府与事业单位会计'], [12, '00098国际市场营销学'], [13, '00107现代管理学'], [14, '00147人力资源管理（一）'], [15, '00149国际贸易理论与实务'], [16, '00150金融理论与实务'], [17, '00158资产评估'], [18, '00159高级财务会计'], [19, '00160审计学'], [22, '02331数据结构'], [23, '04741计算机网络原理'], [28, '00795综合英语（二）'], [30, '00087英语翻译'], [31, '00794综合英语（一）'], [33, '00832英语词汇学'], [34, '00596英语阅读（二）'], [40, '00228环境与资源保护法学'], [51, '00060财政学'], [52, '00065国民经济统计概论'], [53, '00093国际技术贸易'], [54, '00100国际运输与保险'], [55, '00102世界市场行情'], [56, '00144企业管理概论'], [57, '00146中国税制'], [58, '00152组织行为学'], [59, '00161财务报表分析（一）'], [60, '00182公共关系学'], [61, '00184市场营销策划'], [62, '00223中国法制史'], [63, '00226知识产权法'], [64, '00227公司法'], [65, '00230合同法'], [66, '00242民法学'], [68, '00245刑法学'], [69, '00246国际经济法概论'], [70, '00260刑事诉讼法学'], [72, '00249国际私法'], [73, '00259公证与律师制度'], [74, '00261行政法学'], [75, '00262法律文书写作'], [76, '00263外国法制史'], [77, '00264中国法律思想史'], [78, '00312政治学概论'], [79, '00319行政组织理论'], [80, '00320领导科学'], [81, '00341公文写作与处理'], [82, '00342高级语言程序设计（一）'], [83, '00522英语国家概况'], [84, '00540外国文学史'], [85, '00541语言学概论'], [87, '00603英语写作'], [88, '00604英美文学选读'], [89, '00831英语语法'], [90, '01848公务员制度'], [92, '02318计算机组成原理'], [94, '02325计算机系统结构'], [95, '02326操作系统'], [96, '03004社区护理学（一）'], [97, '03005护理教育导论'], [98, '03006护理管理学'], [99, '03007急救护理学'], [100, '03008护理学研究'], [101, '03009精神障碍护理学'], [102, '03010妇产科护理学（二）'], [103, '03011儿科护理学（二）'], [104, '03200预防医学（二）'], [105, '03201护理学导论'], [106, '03202内科护理学（二）'], [107, '03203外科护理学'], [108, '03350社会研究方法'], [109, '04435老年护理学'], [110, '04436康复护理学'], [111, '04735数据库系统原理'], [112, '04737计算机-C++程序设计（本科）'], [113, '04747Java语言程序设计（一）'], [114, '05677法理学'], [115, '05678金融法'], [116, '05680婚姻家庭法'], [117, '05844国际商务英语'], [118, '00076国际金融'], [119, '00078银行会计学'], [120, '00089国际贸易'], [121, '00090国际贸易实务（一）'], [122, '00153质量管理（一）'], [123, '00156成本会计'], [124, '00157管理会计（一）'], [125, '00162会计制度设计'], [126, '00169房地产法'], [127, '00177消费心理学'], [128, '00178市场调查与预测'], [129, '00179谈判与推销技巧'], [130, '00181广告学（一）'], [131, '00183消费经济学'], [132, '00185商品流通概论'], [133, '00186国际商务谈判'], [134, '00208国际财务管理'], [135, '00233税法'], [136, '00243民事诉讼法学'], [137, '00247国际法'], [138, '00257票据法'], [139, '00265西方法律思想史'], [140, '00292市政学'], [141, '00322中国行政史'], [142, '00394幼儿园课程'], [143, '00395科学·技术·社会'], [144, '00398学前教育原理'], [145, '00445中外教育管理史'], [146, '00449教育管理原理'], [147, '00450教育评估和督导'], [148, '00451教育经济学'], [149, '00453教育法学'], [150, '00454教育预测与规划'], [151, '00457学前教育管理'], [152, '00464中外教育简史'], [153, '00465心理卫生与心理辅导'], [154, '00466发展与教育心理学'], [155, '00467课程与教学论'], [156, '00472比较教育'], [157, '00488健康教育学'], [158, '00506写作（一）'], [159, '00529文学概论（一）'], [160, '00531中国当代文学作品选'], [161, '00534外国文学作品选'], [162, '00535现代汉语'], [163, '00644公关礼仪'], [164, '00653中国新闻事业史'], [165, '00660外国新闻事业史'], [166, '00661中外新闻作品研究'], [167, '00891国际贸易实务（三）'], [168, '00893市场信息学'], [169, '00894计算机与网络技术基础'], [170, '00896电子商务概论'], [171, '00906电子商务网站设计原理'], [172, '00910网络经济与企业管理'], [173, '00908网络营销与策划'], [174, '02113医学心理学'], [175, '02126应用文写作'], [176, '02120数据库及其应用'], [177, '00151企业经营战略'], [178, '00258保险法'], [179, '00277行政管理学'], [180, '00315当代中国政治制度'], [181, '00316西方政治制度'], [182, '00318公共政策'], [183, '00321中国文化概论'], [184, '00323西方行政学说史'], [185, '00530中国现代文学作品选'], [186, '00532中国古代文学作品选（一）'], [187, '00533中国古代文学作品选（二）'], [188, '00537中国现代文学史'], [189, '00538中国古代文学史（一）'], [190, '00539中国古代文学史（二）'], [191, '02316计算机应用技术'], [192, '04732微型计算机及接口技术'], [193, '00597英语写作基础'], [194, '02142数据结构导论'], [196, '00088基础英语'], [197, '00094外贸函电'], [199, '00096外刊经贸知识选读'], [200, '00097外贸英语写作'], [201, '00154企业管理咨询'], [202, '00163管理心理学'], [203, '00167劳动法'], [204, '00385学前卫生学'], [205, '00452教育统计与测量'], [206, '00600高级英语'], [207, '00536古代汉语'], [208, '00830现代语言学'], [209, '00833外语教学法'], [210, '00836英语科技文选'], [211, '00145生产与作业管理'], [212, '00882学前教育心理学'], [213, '00838语言与文化'], [214, '00898互联网软件应用与开发'], [215, '00900网页设计与制作'], [216, '00911互联网数据库'], [217, '00994数量方法（二）'], [218, '02141计算机网络技术'], [219, '02183机械制图（一）'], [220, '02333软件工程'], [221, '05679宪法学'], [222, '12339幼儿园教育基础'], [223, '12344学前教育政策与法规'], [224, '02159工程力学（一）'], [225, '02323操作系统概论'], [226, '00092中国对外贸易'], [227, '02185机械设计基础'], [228, '02195数控技术及应用'], [229, '02194工程经济'], [231, '02199复变函数与积分变换'], [232, '02200现代设计方法'], [233, '02202传感器与检测技术'], [234, '02205微型计算机原理与接口技术'], [235, '02238模拟、数字与电力电子技术'], [236, '02240机械工程控制基础'], [237, '02241工业用微型计算机'], [238, '02243计算机软件基础（一）'], [239, '02335网络操作系统'], [240, '02379计算机网络管理'], [241, '02382管理信息系统'], [242, '02439结构力学（二）'], [243, '02440混凝土结构设计'], [244, '02442钢结构'], [245, '02448建筑结构试验'], [246, '02628管理经济学'], [247, '02899生理学'], [248, '02901病理学'], [249, '02903药理学（一）'], [250, '02996护理伦理学'], [251, '02997护理学基础'], [252, '03000营养学'], [253, '03142互联网及其应用'], [254, '03179生物化学（三）'], [255, '03291人际关系学'], [256, '03347流体力学'], [257, '03349政府经济管理概论'], [258, '03657学前教育研究方法'], [259, '04730电子技术基础（三）'], [260, '04742通信概论'], [261, '04751计算机网络安全'], [262, '02237自动控制系统及应用'], [263, '04749网络工程'], [264, '02864微生物学与免疫学基础'], [265, '02447建筑经济与企业管理'], [266, '02404工程地质及土力学'], [267, '02275计算机基础与程序设计'], [268, '02232电工技术基础'], [269, '02236可编程控制器原理与应用'], [270, '02245机电一体化系统设计']]

    return subjectId

def get_paperId(subId):
    # subId = 4
    # # url = "http://www.edu-edu.com/exam-admin/real/public/exams/json/"+str(subId)+"?page=1&pageCount=10&site_preference=mobile&ct=client"
    # url = "http://www.edu-edu.com/exam-admin/real/public/exams/json/" + str(subId)
    #
    # res = requests.get(url,headers=gheader)
    jsonData= {'exams': [{'examTitle': '2017年10月高等数学（一）真题及答案解析', 'examId': 24}, {'examTitle': '2017年4月高等数学（一）真题及答案解析', 'examId': 25}, {'examTitle': '2016年10月高等数学（一）真题及答案解析', 'examId': 26}, {'examTitle': '2015年10月高等数学（一）真题及答案解析', 'examId': 27}, {'examTitle': '2015年4月高等数学（一）真题及答案解析', 'examId': 28}, {'examTitle': '2014年10月高等数学（一）真题及答案解析', 'examId': 29}], 'success': True}

    # print(res.json())
    for data in jsonData["exams"]:
        pass

    pass



def any_json(paperId):

    url= ""
    res = requests.get(url,headers=headers)

    dataJson = res.json()


    print(dataJson)
    pass


if __name__ == '__main__':
    get_paperId(1)
    pass
